[{"title":"机器学习理论(1) 学习理论框架","date":"2017-11-20T00:00:00.000Z","path":"2017/11/20/2017-11-20-1/","text":"学习的基础是可学习性。可学习性包括三个方面：是否是可计算的；计算的复杂度如何；算法如何实现。在机器学习领域有一整套严格的形式化语言来描述这些问题。作为机器学习理论系列的第一篇，这里主要梳理了学习的概念、学习的分类、学习方法的大致框架等内容。 1. 什么是学习学习一词是我们再熟悉不过的了，从小时候总是被提及的好好学习，天天向上，到政治课本上的学习型社会，终身学习；从MOOC，远程教育等愈发多样的学习形式，再到引广泛争论的学习无用论，学习的概念充斥于我们的生活。 学习也同样是心理学(Psychology)，认知神经科学(Cognitive Neuroscience, CN)，计算机科学(Computer Science, CS)等领域所关心的课题。个体的学习能力发展，学习的方法技巧，学习的分子机制，机器学习的原理与应用等等都是当今教育、科学领域的热门话题。 学习之所以如此为家长们所汲汲，为大众所乐道，大概是因为学习总是与智慧的评价，解决问题的能力，竞争中所能取得的优势等相关联，看起来大概是有助于提升我们的适应与生存能力。 我们对于学习是如此熟悉，学习对于我们而言却又如此陌生，我们对于学习的生理机制也还仅略知皮毛，对于machine learning的实现也还抱有一些疑问，甚至于我们没有一个统一而确切的概念去描述它。在Psychology和NS中，学习与记忆是一对经常被一起提到的概念，对于学习与记忆间的关系也常有着如下的定义： 学习(Learning)是获取新信息的过程，学习的结果就是记忆(Memory)。学习与记忆可以假设为如下三个主要阶段： 编码(encoding): 对输入的信息进行处理与储存，编码又可以分为获取(acquision)和巩固(consolidation)这两个过程。获取指的是对感觉通路和感觉分析阶段的输入信息进行登记；巩固是生成一个虽时间推移而增强的表征。 存储(storage): 是获取和巩固的结果，代表了信息的长久记录。 提取(retrieval): 是通过利用所存储的信息创建意识表征或执行习得的行为，如自动化动作。 这似乎很符合我们的经验：我们将经验与知识保存为记忆，在新的情景下调用记忆处理新的问题，比如当学习过how to make a good cup of tea的protocol后，再次需要make tea的时候，按照记忆中的步骤一步步完成就可以了；我们将所确认过的骚扰电话存入一个数据库，当遇到一个新号码时，只需将这个号码和数据库中的号码一一比对，即可判断是不是骚扰电话。 虽然这种基于记忆的学习方式看起来很有用，但有一些问题我们却不能忽视：当我们认识一个新朋友时，我们会记住他的面孔，口音，衣着等等；再次见面时，也许他的衣着变了，发型变了，虽然他和我们记忆中的表征有些不一样了，但我们还是会把他当作认识的那个人；即使说话习惯从广州白话变成了上海闲话，或许我们还是能够认出他来；但如果是从一个文艺青年变成了中二少年。。那个，不好意思，请问您是那位。。 这提示我们：需要有多大的不同我们才会判断新出现的目标与我们记忆中的原型是不一致的呢？换言之，我们是通过什么标准来进行分类判别的呢？再把问题拓展一点，学习貌似不单单是与记忆做比较，成功的学习应当能够从个例出发进行泛化，在一定范围内对于目标的变异具有适应性，甚至在具有相似特征的对象间进行迁移：如果事先知道青的橘子，苹果，杏都很酸，那么在第一次遇见青的葡萄时，应当也可以假设，青的葡萄也是酸的；如果学习不具有这种能力的话，那么假如男朋友换了个发型就不认识了，那该是个多么悲伤的故事: ) 更何况，记忆本身的维持也是具有不同程度的区别，记忆的熟悉性与再认在功能与机制上可能也是分离的，有些事情我们明明已经记不大清了，但仍会影响到我们对于新事物的决策，如何解释这一现象，它们对于学习分别有何影响，也是需要我们去思考的。从学习的角度出发，或许记忆本就是学习的一种副产品，记忆的价值，进化中的动力，也几乎都是通过学习来体现的。进一步从学习机制的角度考虑，记忆也许仅仅是feedforward network学习过程中训练出的firing sequence的一种体现，Brunel的一些研究就为这一看法提供了支持。还有更多的一些可能，这里暂不展开讨论。 2. 归纳偏置与credit assignment problem对于学习，一个概括性，不够全面，非操作性的定义是，学习是一个将经验转化为专业技能或知识的过程。操作性的定义大概在学习的一般模型中可以看到，这里我们先来讨论两个例子。 第一个例子是B. F. Skinner著名的实验，迷信的鸽子。Skinner在鸽笼中放置了定时投喂装置，当食物第一次送达时，鸽子们处于不同的活动状态，如转动头部，转圈等。鸽子们误以为食物的到来与自己的动作有关，于是食物的到来强化了这种动作，为了得到更多的食物，鸽子们不断重复第一次食物送来时的动作状态。 第二个例子是老鼠的怯饵效应。Garcia &amp; Koelling (1996)发现，当在大鼠进食后给予电击，大鼠并没有将电击与进食联系起来，即使将进食后的电击重复多次，大鼠仍然倾向于继续进食。当然，这可能仅仅因为大鼠觉得电就电好了，反正我要吃饱。。于是进一步地，研究者在大鼠的食物中混杂药物，导致大鼠食用食物后反胃呕吐，大鼠会避免再次进食；而如果在大鼠进食有毒食物的同时给予声音刺激，大鼠也并没有表现出如再次面对有毒食物时的害怕趋避表现。这似乎表明，大鼠具有某种“先验知识”，能够理解进食与电击，声音与反胃间并不存在直接的因果关系。 鸽子与大鼠间行为差异的关键在于，可能存在的先验知识的引入使得学习机制出现了偏差，鸽子无法区分诸多线索中哪一个才是真正与反馈的出现存在因果关系，从而错误地将某一线索与反馈联系起来了；大鼠拥有关于食物、点击、不良反应、声音等的先验知识，在学习的过程中，这些先验知识使得学习的方向发生了偏差，从而获取有先验知识约束的更为准确的知识，这种现象被称做归纳偏置。 在之后对于偏差和复杂度的讨论中我们可以证明，归纳偏置对于一个成功的算法而言是必不可少的部分。先验假设越强，就越容易从样本中进行可靠的学习；然而同时，过强的先验假设也会牺牲学习的灵活性。 与鸽子与大鼠的经历类似，在生活中，我们常常会同时接受很多种刺激，如何将真正有价值的线索-反馈对分离出来，并针对某一特定反馈，为不同的线索的分配价值，这样的credit assignment problem是学习过程不可回避的问题。不幸的是，很多时候我们也并没有比鸽子做得更好，关于credit assignment problem更多的细节或许会在一个新的专题来进行讨论。 3. 学习的种类根据不同的分类标准，学习有多种分类方法。就学习理论的研究而言，可能会更多地倾向于从学习与环境的关系，学习的主动性，学习的形式这三个角度来进行分类。 3.1 学习与环境的关系如果把学习过程抽象为“利用经验获取技能的过程”，经验即是学习的对象，通过从经验中获取“技能”，解决新的问题即是学习的结果。在不同的情景下我们能够利用的经验也是不同的。根据学习时能够从经验中获取的信息，可以将学习分为监督学习，非监督学习，和强化学习三类。 监督学习(Supervised Learning)监督学习(Unsupervised Learning)顾名思义指的是在学习的过程中存在“监督者”对学习的结果，即提供正确的输入输出信息供学习器（脑或机器）学习。如对于急性昏迷病人的预后判断，我们希望可以通过病人的脑电数据检测预测病人的预后（能够转醒或进入持续性植物状态，PVS）。那么我们就可以事先获得已知预后的病人的资料，并将脑电数据与预后状况配对，交给学习器进行学习。 在这种情况下经验中包含了有关学习对象的完整的信息，通过已知正确的输入与输出对，学习所提供样本的特征，从而对与训练数据相似的新的数据进行分类，或检测其中的异常值。在上面的例子中，如果学习器学会了脑电数据与预后间的关系，那么就可以利用这种关系预测新的病人的预后了。 非监督学习(Unsupervised Learning)在非监督学习(Unsupervised Learning)中，经验没有提供学习对象额外的信息，用于学习的对象即训练数据与学习器在学习后需要接触到的实际数据间没有区别。同样以急性昏迷病人的预后判断为例，我们只是单纯地提供给学习器病人的脑电数据，学习器需要自己在这些数据中获取信息，发现规律，通常的结果是，学习器可以从这些数据中提取出概括的信息，即降维，如找出脑电信号中的主要成分，或是进行聚类，将相似的数据归为一类，如在理想情况下，学习器可能会自然地将病人分为两类，恰好对应预后转醒和PVS。 强化学习(Reinforcement learning, RL)强化学习(Reinforcement Learning, RL)大致是介于监督学习与非监督学习之间，虽然没有一个监督者能够告诉强化学习的学习器正确的答案，但能够对学习器的选择给予反馈，David Silver（main programmer on the Go team at DeepMind Google）在UCL的课程中对RL有很好的介绍。 强化学习是基于奖励假设(Reward Hypothesis)的一种学习过程： Reward Hypothesis: All goals can be described by the maximisation of expected cumulative reward 在强化学习中，通常会有一个预设的目标，如在试图在围棋对弈中取胜，围棋中的每一步行子并不会有绝对的正误之分，但却会对最终能否取胜产生影响，我们可以分析每一步对于最终获胜的贡献程度而选择最佳的落子方式。 与其他的学习方式相比，RL具有如下特征： 不存在监督者，只有奖励信号 反馈会延迟，而非即时对应，一个动作的反馈信号可能会很久后到来 时间很重要，RL是一个动态的过程，这一过程经常被马尔科夫决策过程所描述，动作-状态对是序列发生的，并不能通过i.i.d数据进行学习；结合第二点，动作的反馈可能有长时与短时之分，短时获益的选择可能会导致一段时间后的损失，眼下并不能获益的行为可能最有助于达到最终的目标。 如上所述，学习器所获得的信号并非是固定的，而是由其自身的行为决定。某一时刻下学习器的选择会决定之后的状态。 我们所能够遇到的场景通常也都与RL所假设的一致，总体上看是在探索未知领域与遵从已有知识间找到平衡。这种目标导向的学习方式相较于监督学习与非监督学习也更加灵活，也被认为是人类最为主要的学习方式之一。 3.2 主动学习器与被动学习器学习器可以根据与获取训练数据的方式分为主动学习器和被动学习器。 主动学习器会在学习时通过提问或实验的方式与环境交互，如一个学习器在学习标记垃圾邮件时，会主动挑选出一些邮件要求用户标记，从而提高对“垃圾邮件的理解”。 被动学习器则完全依据事先提供的信息进行学习。 3.3 在线学习与批量学习批量学习指一次性处理大量的数据后获取技能；在线学习指在新数据到来后，立即考虑新数据的影响并对学习结果进行更新，一般而言，这样的学习结果更加有效。而从人类的学习与分析表现上看，应当是具有实现类似于在线学习的能力。 4. 学习的方法关于学习理论，有许多不同的流派持有不同的看法。这里就产生式分类和判别式分类，频率派与贝叶斯派的基本方法进行简单的介绍。 4.1 生成的分类与识别的分类考虑如果已知观测对象是模式$\\boldsymbol{x}$，如这是急性昏迷病人的脑电模式，使得分类类别$y$（预后：转醒，PVS）在模式$\\boldsymbol{x}$下的条件概率$p(y\\mid\\boldsymbol{x})$最大的的类别$\\hat{y}$，就是这一病人相匹配的预后类别。$$\\hat{y}=\\mathrm{argmax; }p_y(y\\mid\\boldsymbol{x})$$这里”$\\mathrm{argmax}$ “是取最大值时的参数的意思。在模式识别里条件概率$p(y\\mid\\boldsymbol{x})$常被称作后验概率。应用训练集直接对后验概率$p(y\\mid\\boldsymbol{x})$进行学习的过程，称为判别式分析。 此外，还可以把后验概率$p(y\\mid\\boldsymbol{x})$表示为$y$的函数$$p(y\\mid\\boldsymbol{x})=\\frac{p(\\boldsymbol{x},y)}{p(\\boldsymbol{x})}\\propto{p(\\boldsymbol{x},y)}$$根据上式，我们可以发现模式$\\boldsymbol{x}$和类别$y$的联合概率$p(\\boldsymbol{x},y)$与后验概率$p(y|\\boldsymbol{x})$是成正比的。因此，我们可以通过使联合概率$p(\\boldsymbol{x},y)$达到最大值的方法，得到使后验概率$p(y\\mid\\boldsymbol{x})$达到最大值的类别$\\hat{y}$。$$\\hat{y}=\\mathrm{argmax;}p_y(\\boldsymbol{x},y)$$在模式识别力，联合概率$p(\\boldsymbol{x},y)$也被成为数据生成概率，通过预测数据生成概率$p(\\boldsymbol{x},y)$来进行模式识别的分类方法，称为生成的分类。 一般而言，解决一个特殊问题所需的信息小于解决这个特殊问题所属的一般问题的信息。因为生成概率与后验概率的关系为：$$p(y\\mid\\boldsymbol{x})=\\frac{p(\\boldsymbol{x},y)}{p(\\boldsymbol{x})}=\\frac{p(\\boldsymbol{x},y)}{\\Sigma_yp(\\boldsymbol{x},y)}$$在已知生成概率$p(\\boldsymbol{x},y)$的情况下可以很容易地得到后验概率$p(y\\mid\\boldsymbol{x})$，而已知后验概率$p(y\\mid\\boldsymbol{x})$的情况下却难以得到生成概率$p(\\boldsymbol{x},y)$。 在具有一定先验知识的情况下，可以事先得到生成概率$p(\\boldsymbol{x},y)$，在先验概率的约束下，相当于具有了归纳偏置的能力，能对推断结果有更好的限制，相对而言生成的分类是更好的方式；而在没有先验知识，不知道生成概率$p(\\boldsymbol{x},y)$的情况下，则仅能够通过后验概率$p(y\\mid\\boldsymbol{x})$使用识别的分类进行推断了。 4.2 统计概率和朴素贝叶斯统计概率的学习方法将对某一模式的描述看作是学习的结果；学习的目的是通过训练集如$\\mathcal{D}$，得到对包含参数$\\boldsymbol{\\theta}$的模式$q(\\boldsymbol{x},y;\\boldsymbol{\\theta})$的精确描述。$$\\max_\\theta\\prod_{i=1}^{y}q(\\boldsymbol{x}_i,y_i;\\boldsymbol{\\theta})$$朴素贝叶斯方法则将从模式$\\boldsymbol{\\theta}$产生的角度出发，将其看作是概率变量；依据贝叶斯定理，就可以通过求得的后验概率$p(\\boldsymbol{\\theta}\\mid\\mathcal{D})$估计先验概率$p(\\boldsymbol{\\theta})$。$$p(\\boldsymbol{\\theta}\\mid\\mathcal{D})=\\frac{p(\\mathcal{D}\\mid\\boldsymbol{\\theta})p(\\boldsymbol{\\theta})}{p(\\mathcal{D})}=\\frac{\\prod_{i=1}^nq(\\boldsymbol{x}_i,y_i\\mid\\boldsymbol{\\theta})p(\\boldsymbol{\\theta})}{\\int\\prod_{i=1}^nq(\\boldsymbol{x}_i,y_i\\mid\\boldsymbol{\\theta})p(\\boldsymbol{\\theta})\\mathrm{d}\\boldsymbol{\\theta}}$$ 5. 学习的理论框架5.1 学习器的输入领域集(domain set)领域集即我们希望学习的对象的总体，可以是任意的集合$\\mathcal{X}$。领域集中的元素通常可以用描述了其特征的向量表示，从心理学研究问题的角度出发，这些特征就是有关研究对象的因素，每个因素又存在不同的水平。如对于木瓜而言，其具有的特征有颜色，软硬程度等，对于颜色特征而言又有绿色，黄色等水平。在围棋对弈中，可以落子的位置构成了当前状态下的领域集。 领域集中的元素也叫做实例，因此$\\mathcal{X}$也被叫做实例空间。 标签集(label set)标签是指我们希望通过学习得到的有关实例的信息，标签集$\\mathcal{Y}$即是所有标签的集合。就木瓜的例子而言，我们会希望通过对于木瓜特征的学习，辨别木瓜好不好吃，因此给予木瓜的标签可以是好吃（为方便起见，用$1$表示）和不好吃（用$0$表示），因此对于木瓜的领域集$\\mathcal{X}$而言，其标签集$\\mathcal{Y}$为${1,0}$。 训练数据(training data)为了使得学习器学习到有关领域集的知识，通常我们都需要获得该领域集中的一些样本供学习器学习。训练数据至少应包含领域集内实例的部分特征，在监督学习情况下，训练数据还应包含实例所对应的标签，即训练数据以$\\mathcal{X}\\times\\mathcal{Y}$的形式成对出现，训练数据可以表示为训练集$S={(X_1,Y_1),\\cdots,(x_m,y_m)}$这样一个有限的序列。 5.2 学习器的输出学习器学习的目的是从训练数据中学会适用于训练数据所属领域集的知识，即可以给未加标签的实例加上预测的标签，这样的过程可以用一个描述从$\\mathcal{X}$到$\\mathcal{Y}$映射的函数表示，$h:\\mathcal{X}\\boldsymbol{\\to}\\mathcal{Y}$，这样的映射被称为预测规则(prediction rule)，这样的函数也可以被称为预测器(predictor)，假设(hypothesis)或分类器(classifier)。 通常我们用$A(S)$来表示学习算法$A$在给定的训练序列$S$下返回的假设。 5.3 获取训练数据从领域集中抽取合适的样本实际上是个很复杂的问题，通常我们会希望抽取的样本能与领域集独立同分布(i.i.d)，即训练数据$\\mathcal{S}$亦从领域集$\\mathcal{X}$的分布$\\mathcal{D}$中抽取，服从$\\mathcal{D}$的分布。 我们假设，对领域集而言，实例特征与标签间存在正确的映射关系$f:\\mathcal{X}\\boldsymbol{\\to}\\mathcal{Y}$，对于任意的$i$均有$y_i=f(x_i)$。学习器通过算法$A$学习训练数据，以正确的映射关系$f(x)$为目标，寻找$\\mathcal{X}$与$\\mathcal{Y}$间的映射关系，为训练数据赋予正确的标签，最终产生学习到的映射关系$h(x)$。 5.4 评估学习结果分类器的误差被定义为，从领域集$\\mathcal{X}$的分布$\\mathcal{D}$中随机抽取一个样本$x$，使得$h(x)\\boldsymbol\\ne f(x)$的概率。 $h:\\mathcal{X}\\boldsymbol{\\to}\\mathcal{Y}$的错误率被定义为$\\newcommand{\\eqdef}{\\overset{\\mathrm{def}}{=}}$ $$L_{\\mathcal{D},f}\\eqdef\\mathbb{P}_{x\\sim\\mathcal{D}}[h(x)\\ne f(x)]\\eqdef\\mathcal{D}({x:h(x)\\neq f(x)})$$$L_{\\mathcal{D},f}(h)$也称为泛化误差，真实误差，或损失函数(cost function)，其下标$(\\mathcal{D},f)$表明误差的测量是基于概率分布$\\mathcal{D}$和正确标记函数$f(x)$进行的。在接下来对于PAC可学习性的讨论中，还会讨论这种损失的其他的可能形式。 6. 经验风险最小化6.1 经验风险学习的过程是从领域集$\\mathcal{X}$的分布$\\mathcal{D}$中获取训练集$S$，我们希望学习器能通过某种算法得到一个预测器$h_S:\\mathcal{X}\\boldsymbol{\\to}\\mathcal{Y}$，使得关于分布$\\mathcal{D}$和正确标记函数$f(x)$的预测误差最小化。 由于我们并不知道分布$\\mathcal{D}$和正确标记函数$f(x)$究竟是什么样的，因此我们需要借助学习器在训练样本中的误差来对犯错的风险进行估计：$$L_S(h)\\eqdef\\frac{\\vert{i\\in[m]:h(x_i)\\ne y_i}\\vert}{m}$$其中，$[m]={1,\\cdots,m}$ 这种从训练数据中得到的对风险的估计被称为经验风险或经验误差。由于我们假设训练集能够代表领域集的特征，因此，这种从训练集估计$\\mathcal{X}\\boldsymbol{\\to}\\mathcal{Y}$映射并以经验风险代表估计的真实风险的做法是可以接受的。这种寻求拥有最小经验风险的过程称为经验风险最小化(Empirical Risk Minization，ERM)。 6.2 过拟合由于训练数据具有有限的数据量，如果不考虑寻找到的规则$h(x)$的复杂度，一定能够找到一种方法，将训练集中$\\mathcal{X}\\boldsymbol{\\to}\\mathcal{Y}$的关系拟合得很好。一个极端的例子是，如果学习过程变成了单纯的记忆，那么$L_\\mathcal{D}(h_S)$一定会等于$0$。 通常过拟合发生时会导致，对训练数据拟合得非常好，但在训练数据之外表现得非常糟糕。 7. 考虑归纳偏置的经验风险最小化7.1 归纳偏置的影响过拟合产生的一个重要原因在于，学习器对于真实的映射关系$f(x)$没有任何先验的概念，即不知道$f(x)$应该有的样子，$f(x)$本身应该有的性质无法对本应与$f(x)$一致的$h(x)$产生限制，$h(x)$为了适应数据而可以不考虑复杂度变得非常奇怪。 又或者说，如果仅仅知道晚饭吃饱了而去推测晚上吃了什么，那么无论是中餐、西餐、日料、压缩饼干甚至是某些奇奇怪怪的东西都可以满足这一要求，但如果事先知道这是个中国人，而且是南方人，那么猜测的范围就可以大大缩小了。 因此，在学习器接触训练集开始学习之前，就可以通过基于所学学习问题的先验知识，将基于训练集$S$的可能的选择器$h(x)$的范围限制于一个集合$\\mathcal{H}$中，这样的一个集合被称为假设类。在ERM准则下，假设类利用ERM规则进一步选择出合适的预测器$h\\boldsymbol\\in\\mathcal{H}$，这一过程可用如下形式表示$$ERM_\\mathcal{H}(S)\\in\\mathrm{argmax;}_{h\\in\\mathcal{H}}L_S(h)$$接下来将会证明，为什么基于此假设类的$\\mathrm{ERM}_\\mathcal{H}$能够保证不过拟合，以及选择哪种假设类$\\mathrm{ERM}_\\mathcal{H}$不会导致过拟合。 7.2 真实风险的来源置信参数(confidence parameter)由于学习器仅能通过训练集$S$学习在$\\mathcal{D}$上分布的领域集$\\mathcal{X}$，因此$S$与$\\mathcal{X}$分布的差异会导致真实误差$L_{\\mathcal{H},f}$的增加。为保证学习器所学习到的$h(x)$的准确性，需要保证$S$中的训练样本满足独立同分布(i.i.d.)假设，都是从$\\mathcal{D}$中独立同分布地抽取的，记为$S\\boldsymbol\\sim\\mathcal{D}^m$，其中$m$为$S$的势，即为在分布$\\mathcal{D}$下，独立同分布采样$S\\boldsymbol=z_1,\\cdots,z_m$。 然而实际上，我们难以保证抽样的独立同分布，即使一学期仅有三次点名，一学期也仅skip三次课，也是有可能全部赶上点名的: ) 因此，我们将采样到不能代表领域集$\\mathcal{X}$的训练集$S$的概率表示为$\\delta$，并将$1-\\delta$称为该预测的置信参数(confidence parameter) 精度参数(accuracy parameter)同样的，我们也无法保证$h(x)$所给出的预测结果的正确性，此时，我们使用精度参数(accuracy parameter)$\\varepsilon$来评价$h(x)$预测的质量，如果$L_{\\mathcal{D},f}&gt;\\varepsilon$，那么$h(x)$就是一种失败的预测；如果$L_{\\mathcal{D},f}{\\leq}\\varepsilon$，那么就认为$h(x)$给出了一个误差可以接受的预测。 7.3 学习的可靠性对于$S\\sim\\mathcal{D}^m$的训练集来说，设$\\mathcal{H}_B$是失败的假设集合，那么有：$$\\mathcal{H}_B={h\\in\\mathcal{H}:L_{\\mathcal{D},f}(h)&gt;\\varepsilon}$$设集合$M$是一个误导集，$$M={S\\mid_x \\exists :h\\in\\mathcal{H}_B,L_S(h)=0}$$ 即$M$中的假设对于领域集来说是失败的预测，但对于训练集来说，则是符合精度参数要求的。即$M$描述了过拟合的$h(x)$。","tags":[{"name":"Learning Theory","slug":"Learning-Theory","permalink":"http://example.com/tags/Learning-Theory/"}]}]